mfo/20240330105337-mfo_jogo_da_velha_em_quint.org
:PROPERTIES:
:ID:       2e70fcd6-d025-4432-93b0-146a29ad9a00
:END:
#+title:  Jogo da Velha em Quint
#+EMAIL:     gabrielamoreira05@gmail.com
#+DATE:      01 de abril de 2024
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:nil \n:t @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:nil pri:nil tags:not-in-toc
#+BEAMER_FRAME_LEVEL: 2
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [smaller]
#+BEAMER_THEME: udesc
#+BEAMER_HEADER: \input{header.tex} \subtitle{Aula para disciplina de Métodos Formais} \institute{Departamento de Ciência da Computação - DCC\\Universidade do Estado de Santa Catarina - UDESC}
#+LATEX_COMPILER: pdflatex
#+bibliography: references.bib
#+cite_export: csl ~/MEGA/csl/associacao-brasileira-de-normas-tecnicas.csl
#+PROPERTY: header-args :tangle tictactoe.qnt
#+HTML: <a href="https://bugarela.com/mfo/slides/20240330105337-mfo_jogo_da_velha_em_quint.pdf">Slides</a><br />
#+beamer: \begin{frame}{Conteúdo}
#+TOC: headlines 3
#+beamer: \end{frame}

* Jogando de qualquer jeito
** Jogo da Velha
Todos conhecem jogo da velha?
#+BEAMER: \medskip
#+BEAMER: \pause
PS: a partir de hoje, não vou mais traduzir as especificações para português
- Acho legal usar português no início para que fique claro o que são =keywords= (sempre em inglês) e o que podemos escolher o nome (nesses casos, em português)
- A partir daqui, vou usar os exemplos originais, em inglês.

** Tipos e variáveis
Definimos os seguintes tipos
#+begin_src quint
type Player = X | O
type Square = Occupied(Player) | Empty
#+end_src

E as seguintes variáveis
#+begin_src quint
/// A 3x3 tic-tac-toe board
var board: int -> int -> Square

/// Who goes next
var nextTurn: Player
#+end_src

** Definições sobre coordenadas

#+begin_src quint
pure val boardCoordinates = tuples(1.to(3), 1.to(3))

def square(coordinate: (int, int)): Square =
  board.get(coordinate._1).get(coordinate._2)

def hasPlayer(coordinate, player) =
  match square(coordinate) {
    | Empty       => false
    | Occupied(p) => player == p
  }

def isEmpty(coordinate) =
  match square(coordinate) {
    | Empty  => true
    | _      => false
  }
#+end_src


** Definições sobre o tabuleiro
#+begin_src quint
val boardEmpty = boardCoordinates.forall(isEmpty)

val boardFull = not(boardCoordinates.exists(isEmpty))
#+end_src

** Definindo "ganhar" - coordenadas
- Como o tabuleiro é sempre 3x3, é mais fácil listar todas as combinações de coordenadas que levam a uma vitória do que implementar os cálculos.
- Usamos =Set= - não precisamos de ordem nem de repetição, logo não devemos usar =List=.
#+begin_src quint
pure val winningPatterns = Set(
  // Horizonal wins
  Set((1,1), (1,2), (1,3)),
  Set((2,1), (2,2), (2,3)),
  Set((3,1), (3,2), (3,3)),
  // Vertical wins
  Set((1,1), (2,1), (3,1)),
  Set((1,2), (2,2), (3,2)),
  Set((1,3), (2,3), (3,3)),
  // Diagonal wins
  Set((1,1), (2,2), (3,3)),
  Set((3,1), (2,2), (1,3))
)
#+end_src

** Definindo "ganhar" - operador won
Usamos as definições para =winningPaterns= e =hasPlayer= para determinar se um jogador venceu.
#+begin_src quint
def won(player) = winningPatterns.exists(pattern =>
  pattern.forall(coordinate => hasPlayer(coordinate, player))
)
#+end_src

#+BEAMER: \pause
Com essa definição e =boardFull=, podemos determinar se um jogo já acabou.
#+begin_src quint
val gameOver = won(X) or won(O) or boardFull
#+end_src
- Reparem que o operador =or= pode ser usado na forma infixa (no meio dos argumentos)

** Ações - Move
Um dado jogador faz uma jogada (um /move/) em uma dada coordenada
  - Determinístico
#+begin_src quint
action Move(player, coordinate) = all {
  isEmpty(coordinate),
  board' = board.setBy(
    coordinate._1,
    row => row.set(coordinate._2, Occupied(player))
  ),
}
#+end_src
- Qual é a pré-condição pra essa ação?
  #+BEAMER: \pause
  - A pré-condição para essa ação é que a coordenada esteja vazia
#+BEAMER: \pause
- =setBy= é bem útil pra atualizar mapas aninhados (como nesse caso, =int -> int -> Square=)

** Ações - MoveToEmpty
Um dado jogador faz uma jogada em *alguma* coordenada
  - Não-determinístico
#+begin_src quint
action MoveToEmpty(player) = all {
  not(gameOver),
  nondet coordinate = boardCoordinates.filter(isEmpty).oneOf()
  Move(player, coordinate)
}
#+end_src
- Qual é a pré-condição pra essa ação?
  #+BEAMER: \pause
  - A pré-condição para essa ação é que o jogo ainda não tenha acabado

** Ações - MoveO e MoveX
- Por enquanto, as ações =MoveO= e =MoveX= são bem parecidas porque ambos jogam "de qualquer jeito". Não vamos parametrizar elas porque depois vamos mudar somente o comportamento de =X=.

