docs/mfo/20240330105337-mfo_jogo_da_velha_em_quint.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Jogo da Velha em Quint</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="https://bugarela.com/mfo/20240330105337-mfo_jogo_da_velha_em_quint.html" />
  <meta property="og:title" content="Jogo da Velha em Quint" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Jogo da Velha em Quint">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

  </head>
  <body>
    <div id="layout" class="pure-g">
      <div class="sidebar pure-u-1 pure-u-md-1-3">
  <div class="pure-g">
    <div class="pure-u-1 pure-u-lg-1-2">
    </div>
    <div class="pure-u-1 pure-u-lg-1-2">
      <div class="header">
        <h2 class="brand-title"><a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a></h2>
      </div>
      <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
      </div>
      <div class="footer">
  <div>Created using Emacs and <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a></div>
</div>

    </div>
  </div>
</div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <h2>Jogo da Velha em Quint</h2>
        <a href="https://bugarela.com/mfo/slides/20240330105337-mfo_jogo_da_velha_em_quint.pdf">Slides</a><br />
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#jogando-de-qualquer-jeito-1">1. Jogando de qualquer jeito</a>
<ul>
<li><a href="#jogo-da-velha-2">1.1. Jogo da Velha</a></li>
<li><a href="#tipos-e-vari-veis-2">1.2. Tipos e variáveis</a></li>
<li><a href="#defini-es-sobre-coordenadas-2">1.3. Definições sobre coordenadas</a></li>
<li><a href="#defini-es-sobre-o-tabuleiro-2">1.4. Definições sobre o tabuleiro</a></li>
<li><a href="#definindo-ganhar-coordenadas-2">1.5. Definindo &ldquo;ganhar&rdquo; - coordenadas</a></li>
<li><a href="#definindo-ganhar-operador-won-2">1.6. Definindo &ldquo;ganhar&rdquo; - operador won</a></li>
<li><a href="#a-es-move-2">1.7. Ações - Move</a></li>
<li><a href="#a-es-movetoempty-2">1.8. Ações - MoveToEmpty</a></li>
<li><a href="#a-es-moveo-e-movex-2">1.9. Ações - MoveO e MoveX</a></li>
<li><a href="#estado-inicial-2">1.10. Estado inicial</a></li>
<li><a href="#transi-es-2">1.11. Transições</a></li>
<li><a href="#rodando-jogos-aleat-rios-com-o-simulador-2">1.12. Rodando jogos aleatórios com o simulador</a></li>
<li><a href="#usando-uma-invariante-para-procurar-jogos-que-d-o-velha-2">1.13. Usando uma invariante para procurar jogos que &ldquo;dão velha&rdquo;</a></li>
<li><a href="#contraexemplo-2">1.14. Contraexemplo</a></li>
</ul>
</li>
<li><a href="#jogando-pra-ganhar-1">2. Jogando pra ganhar</a>
<ul>
<li><a href="#jogando-pra-ganhar-2">2.1. Jogando pra ganhar</a></li>
<li><a href="#come-ando-com-os-cantos-2">2.2. Começando com os cantos</a></li>
<li><a href="#condi-es-para-as-jogadas-2">2.3. Condições para as jogadas</a></li>
<li><a href="#condi-es-para-as-jogadas-defini-es-auxiliares-2">2.4. Condições para as jogadas - definições auxiliares</a></li>
<li><a href="#a-es-win-2">2.5. Ações - Win</a></li>
<li><a href="#a-es-block-2">2.6. Ações - Block</a></li>
<li><a href="#a-es-takecenter-e-setupwin-2">2.7. Ações - TakeCenter e SetupWin</a></li>
<li><a href="#a-es-alterando-movex-2">2.8. Ações - alterando MoveX</a></li>
<li><a href="#invariantes-2">2.9. Invariantes</a></li>
<li><a href="#f-rmulas-temporais-2">2.10. Fórmulas temporais</a></li>
<li><a href="#tarefa-de-casa-2">2.11. Tarefa de casa</a></li>
<li><a href="#fim-2">2.12. FIM</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-jogando-de-qualquer-jeito-1" class="outline-2">
<h2 id="jogando-de-qualquer-jeito-1"><span class="section-number-2">1.</span> Jogando de qualquer jeito</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-jogo-da-velha-2" class="outline-3">
<h3 id="jogo-da-velha-2"><span class="section-number-3">1.1.</span> Jogo da Velha</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Todos conhecem jogo da velha?<br />
</p>
<p>
PS: a partir de hoje, não vou mais traduzir as especificações para português<br />
</p>
<ul class="org-ul">
<li>Acho legal usar português no início para que fique claro o que são <code>keywords</code> (sempre em inglês) e o que podemos escolher o nome (nesses casos, em português)<br /></li>
<li>A partir daqui, vou usar os exemplos originais, em inglês.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-tipos-e-vari-veis-2" class="outline-3">
<h3 id="tipos-e-vari-veis-2"><span class="section-number-3">1.2.</span> Tipos e variáveis</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Definimos os seguintes tipos<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">type Player = X | O
type Square = Occupied(Player) | Empty
</pre>
</div>

<p>
E as seguintes variáveis<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">/// A 3x3 tic-tac-toe board
var board: int -&gt; int -&gt; Square

/// Who goes next
var nextTurn: Player
</pre>
</div>
</div>
</div>
<div id="outline-container-defini-es-sobre-coordenadas-2" class="outline-3">
<h3 id="defini-es-sobre-coordenadas-2"><span class="section-number-3">1.3.</span> Definições sobre coordenadas</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-quint">pure val boardCoordinates = tuples(1.to(3), 1.to(3))

def square(coordinate: (int, int)): Square =
  board.get(coordinate._1).get(coordinate._2)

def hasPlayer(coordinate, player) =
  match square(coordinate) {
    | Empty       =&gt; false
    | Occupied(p) =&gt; player == p
  }

def isEmpty(coordinate) =
  match square(coordinate) {
    | Empty  =&gt; true
    | _      =&gt; false
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-defini-es-sobre-o-tabuleiro-2" class="outline-3">
<h3 id="defini-es-sobre-o-tabuleiro-2"><span class="section-number-3">1.4.</span> Definições sobre o tabuleiro</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-quint">val boardEmpty = boardCoordinates.forall(isEmpty)

val boardFull = not(boardCoordinates.exists(isEmpty))
</pre>
</div>
</div>
</div>
<div id="outline-container-definindo-ganhar-coordenadas-2" class="outline-3">
<h3 id="definindo-ganhar-coordenadas-2"><span class="section-number-3">1.5.</span> Definindo &ldquo;ganhar&rdquo; - coordenadas</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Como o tabuleiro é sempre 3x3, é mais fácil listar todas as combinações de coordenadas que levam a uma vitória do que implementar os cálculos.<br /></li>
<li>Usamos <code>Set</code> - não precisamos de ordem nem de repetição, logo não devemos usar <code>List</code>.<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-quint">pure val winningPatterns = Set(
  // Horizonal wins
  Set((1,1), (1,2), (1,3)),
  Set((2,1), (2,2), (2,3)),
  Set((3,1), (3,2), (3,3)),
  // Vertical wins
  Set((1,1), (2,1), (3,1)),
  Set((1,2), (2,2), (3,2)),
  Set((1,3), (2,3), (3,3)),
  // Diagonal wins
  Set((1,1), (2,2), (3,3)),
  Set((3,1), (2,2), (1,3))
)
</pre>
</div>
</div>
</div>
<div id="outline-container-definindo-ganhar-operador-won-2" class="outline-3">
<h3 id="definindo-ganhar-operador-won-2"><span class="section-number-3">1.6.</span> Definindo &ldquo;ganhar&rdquo; - operador won</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Usamos as definições para <code>winningPaterns</code> e <code>hasPlayer</code> para determinar se um jogador venceu.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">def won(player) = winningPatterns.exists(pattern =&gt;
  pattern.forall(coordinate =&gt; hasPlayer(coordinate, player))
)
</pre>
</div>

<p>
Com essa definição e <code>boardFull</code>, podemos determinar se um jogo já acabou.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">val gameOver = won(X) or won(O) or boardFull
</pre>
</div>
<ul class="org-ul">
<li>Reparem que o operador <code>or</code> pode ser usado na forma infixa (no meio dos argumentos)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-a-es-move-2" class="outline-3">
<h3 id="a-es-move-2"><span class="section-number-3">1.7.</span> Ações - Move</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Um dado jogador faz uma jogada (um <i>move</i>) em uma dada coordenada<br />
</p>
<ul class="org-ul">
<li>Determinístico<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-quint">action Move(player, coordinate) = all {
  isEmpty(coordinate),
  board' = board.setBy(
    coordinate._1,
    row =&gt; row.set(coordinate._2, Occupied(player))
  ),
}
</pre>
</div>
<ul class="org-ul">
<li><p>
Qual é a pré-condição pra essa ação?<br />
</p>
<ul class="org-ul">
<li>A pré-condição para essa ação é que a coordenada esteja vazia<br /></li>
</ul></li>
</ul>
<ul class="org-ul">
<li><code>setBy</code> é bem útil pra atualizar mapas aninhados (como nesse caso, <code>int -&gt; int -&gt; Square</code>)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-a-es-movetoempty-2" class="outline-3">
<h3 id="a-es-movetoempty-2"><span class="section-number-3">1.8.</span> Ações - MoveToEmpty</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Um dado jogador faz uma jogada em <b>alguma</b> coordenada<br />
</p>
<ul class="org-ul">
<li>Não-determinístico<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-quint">action MoveToEmpty(player) = all {
  not(gameOver),
  nondet coordinate = boardCoordinates.filter(isEmpty).oneOf()
  Move(player, coordinate)
}
</pre>
</div>
<ul class="org-ul">
<li><p>
Qual é a pré-condição pra essa ação?<br />
</p>
<ul class="org-ul">
<li>A pré-condição para essa ação é que o jogo ainda não tenha acabado<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-a-es-moveo-e-movex-2" class="outline-3">
<h3 id="a-es-moveo-e-movex-2"><span class="section-number-3">1.9.</span> Ações - MoveO e MoveX</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Por enquanto, as ações <code>MoveO</code> e <code>MoveX</code> são bem parecidas porque ambos jogam &ldquo;de qualquer jeito&rdquo;. Não vamos parametrizar elas porque depois vamos mudar somente o comportamento de <code>X</code>.<br /></li>
</ul>
</div>
<ol class="org-ol">
