mfo/20240330105337-mfo_jogo_da_velha_em_quint.org
*** Move0
:PROPERTIES:
:BEAMER_col: 0.5
:END:
#+begin_src quint
action MoveO = all {
  nextTurn == O,
  MoveToEmpty(O),
  nextTurn' = X,
}
#+end_src

*** MoveX
:PROPERTIES:
:BEAMER_col: 0.5
:END:
#+begin_src quint
action MoveX = all {
  nextTurn == X,
  MoveToEmpty(X),
  nextTurn' = O,
}
#+end_src

***                                                       :B_ignoreheading:
:PROPERTIES:
:BEAMER_env: ignoreheading
:END:
- Qual é a pré-condição pra essas ações?
  #+BEAMER: \pause
  - Para ambas, a pré-condição é que seja o turno do jogador a fazer a jogada
    - Implicitamente, também temos a pré-condição de =MoveToEmpty= empregada nessa empregada nessa ação

** Estado inicial
#+begin_src quint
action init = all {
  // X always goes first
  nextTurn' = X,
  // Every space in the board starts blank
  board' = 1.to(3).mapBy(_ => 1.to(3).mapBy(_ => Empty)),
}
#+end_src

** Transições
#+begin_src quint
action step = any {
  MoveX,
  MoveO,
  // If the game is over, we don't need to do anything
  all { gameOver, board' = board, nextTurn' = nextTurn },
}
#+end_src

** Rodando jogos aleatórios com o simulador
#+begin_src sh
quint run tictactoe.qnt --max-samples=1
#+end_src

#+BEAMER: \pause
#+begin_src quint
...

[State 20]
{
  board:
    Map(
      1 -> Map(1 -> Occupied(O), 2 -> Occupied(X), 3 -> Occupied(X)),
      2 -> Map(1 -> Occupied(X), 2 -> Occupied(O), 3 -> Occupied(O)),
      3 -> Map(1 -> Occupied(X), 2 -> Occupied(O), 3 -> Occupied(X))
    ),
  nextTurn: O
}
#+end_src

** Usando uma invariante para procurar jogos que "dão velha"
"Dar velha", ou /stalemate/, quer dizer que o tabuleiro está cheio e ninguém ganhou. É um empate.
#+begin_src quint
val stalemate = boardFull and not(won(X)) and not(won(O))

val NotStalemate = not(stalemate)
#+end_src

#+BEAMER: \pause
Essa invariante é fácil de quebrar, podemos usar o simulador ao invés do /model checker/ tranquilamente:
#+begin_src sh
quint run tictactoe.qnt --invariant=NotStalemate
#+end_src

#+BEAMER: \pause
Mas podemos usar o /model checker/ também! Ele vai demorar mais, porque faz BFS e vai levar um tempo para chegar em jogos com 9 jogadas feitas, que são necessárias para um tabuleiro completo.
#+begin_src sh
quint verify tictactoe.qnt --invariant=NotStalemate
#+end_src

** Contraexemplo
#+begin_src quint
[State 9]
{
  board:
    Map(
      1 -> Map(1 -> Occupied(O), 2 -> Occupied(X), 3 -> Occupied(O)),
      2 -> Map(1 -> Occupied(O), 2 -> Occupied(X), 3 -> Occupied(X)),
      3 -> Map(1 -> Occupied(X), 2 -> Occupied(O), 3 -> Occupied(X))
    ),
  nextTurn: O
}
#+end_src

* Jogando pra ganhar
** Jogando pra ganhar
- Jogo da velha é um jogo bem simples e fácil
- Ainda quando crianças, enjoamos do jogo, porque percebemos que "sempre dá velha"
- Hipótese: Se um jogador seguir uma certa estratégia, ele nunca perde.
  - Consequência: Se os dois jogadores seguirem essa estratégia, nenhum dos dois perde - "sempre dá velha"

#+BEAMER: \medskip
#+BEAMER: \pause
*Estratégia*:
- A primeira jogada é sempre nos cantos
- As outras jogadas fazem a primeira jogada possível nessa lista de prioridade:
  - Ganhar
  - Bloquear
  - Jogar no centro
  - Preparar uma vitória (preenchendo 2 de 3 quadrados numa fila/coluna/diagonal)
  - Jogada qualquer

#+BEAMER: \medskip
#+BEAMER: \pause
Vamos implementar essa estratégia para o jogador X, enquanto o jogador O continua jogando "de qualquer jeito".

** Começando com os cantos
#+begin_src quint
pure val corners = Set(
  (1,1),
  (3,1),
  (1,3),
  (3,3)
)

action StartInCorner =
  nondet corner = oneOf(corners)
  Move(X, corner)
#+end_src

** Condições para as jogadas
Precisamos definir as condições que determinam se cada uma das jogadas na lista de prioridade pode ser feita.
  - Ganhar
  - Bloquear
  - Jogar no centro
  - Preparar uma vitória

#+ATTR_LATEX: :options xleftmargin=-0.9cm,linewidth=12.5cm
#+begin_src quint
val canWin = winningPatterns.exists(canWinWithPattern)
val canBlock = winningPatterns.exists(canBlockWithPattern)
val canTakeCenter = isEmpty((2,2))
val canSetupWin = winningPatterns.exists(canSetupWinWithPattern)
#+end_src

(=canWinWithPattern=, =canBlockWithPattern= e =canSetupWintWithPattern= a seguir)

** Condições para as jogadas - definições auxiliares

Dado um /winning pattern/, podemos *ganhar* com aquele /pattern/ sse duas das coordenadas tiverem =X= e a outra estiver vazia. Lembrando que a ordem não importa.
#+begin_src quint
def canWinWithPattern(pattern) = and {
  pattern.filter(coordinate => coordinate.hasPlayer(X)).size() == 2,
  pattern.filter(coordinate => coordinate.isEmpty()).size() == 1,
}
#+end_src

#+BEAMER: \pause
Dado um /winning pattern/, podemos *bloquear* com aquele /pattern/ sse duas das coordenadas tiverem =O= e a outra estiver vazia.
#+begin_src quint
def canBlockWithPattern(pattern) = and {
  pattern.filter(coordinate => coordinate.hasPlayer(O)).size() == 2,
  pattern.filter(coordinate => coordinate.isEmpty()).size() == 1,
}
#+end_src

Dado um /winning pattern/, podemos *preparar uma vitória* com aquele /pattern/ sse uma das coordenadas tiver =X= e as outras duas estiverem vazias.
#+begin_src quint
def canSetupWinWithPattern(pattern) = and {
  pattern.filter(coordinate => coordinate.hasPlayer(X)).size() == 1,
  pattern.filter(coordinate => coordinate.isEmpty()).size() == 2,
}
#+end_src

** Ações - Win
#+begin_src quint
action Win = all {
  canWin,
  nondet pattern = winningPatterns.filter(canWinWithPattern).oneOf()
  nondet coordinate = pattern.filter(isEmpty).oneOf()
  Move(X, coordinate),
}
#+end_src
- Qual é a pré-condição pra essa ação?
  #+BEAMER: \pause
  - =canWin=, lembrando que =canWin= é definido por:
  #+begin_src quint
  val canWin = winningPatterns.exists(canWinWithPattern)
  #+end_src
  #+BEAMER: \pause
  - Isso é importante para garantir que nunca estamos chamando =oneOf= em um set vazio.

