docs/mfo/20240330105337-mfo_jogo_da_velha_em_quint.html
<li><a id="move0-3"></a>Move0<br />
<div class="outline-text-4" id="text-1-9-1">
<div class="org-src-container">
<pre class="src src-quint">action MoveO = all {
  nextTurn == O,
  MoveToEmpty(O),
  nextTurn' = X,
}
</pre>
</div>
</div>
</li>
<li><a id="movex-3"></a>MoveX<br />
<div class="outline-text-4" id="text-1-9-2">
<div class="org-src-container">
<pre class="src src-quint">action MoveX = all {
  nextTurn == X,
  MoveToEmpty(X),
  nextTurn' = O,
}
</pre>
</div>
</div>
</li>
<li><a id="-3"></a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_ignoreheading">B_ignoreheading</span></span><br />
<div class="outline-text-4" id="text-1-9-3">
<ul class="org-ul">
<li><p>
Qual é a pré-condição pra essas ações?<br />
</p>
<ul class="org-ul">
<li>Para ambas, a pré-condição é que seja o turno do jogador a fazer a jogada<br />
<ul class="org-ul">
<li>Implicitamente, também temos a pré-condição de <code>MoveToEmpty</code> empregada nessa ação<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-estado-inicial-2" class="outline-3">
<h3 id="estado-inicial-2"><span class="section-number-3">1.10.</span> Estado inicial</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">
<pre class="src src-quint">action init = all {
  // X always goes first
  nextTurn' = X,
  // Every space in the board starts blank
  board' = 1.to(3).mapBy(_ =&gt; 1.to(3).mapBy(_ =&gt; Empty)),
}
</pre>
</div>
</div>
</div>
<div id="outline-container-transi-es-2" class="outline-3">
<h3 id="transi-es-2"><span class="section-number-3">1.11.</span> Transições</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-quint">action step = any {
  MoveX,
  MoveO,
  // If the game is over, we don't need to do anything
  all { gameOver, board' = board, nextTurn' = nextTurn },
}
</pre>
</div>
</div>
</div>
<div id="outline-container-rodando-jogos-aleat-rios-com-o-simulador-2" class="outline-3">
<h3 id="rodando-jogos-aleat-rios-com-o-simulador-2"><span class="section-number-3">1.12.</span> Rodando jogos aleatórios com o simulador</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-sh">quint run tictactoe.qnt --max-samples=<span style="color: #d79921; font-weight: bold;">1</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-quint">...

[State 20]
{
  board:
    Map(
      1 -&gt; Map(1 -&gt; Occupied(O), 2 -&gt; Occupied(X), 3 -&gt; Occupied(X)),
      2 -&gt; Map(1 -&gt; Occupied(X), 2 -&gt; Occupied(O), 3 -&gt; Occupied(O)),
      3 -&gt; Map(1 -&gt; Occupied(X), 2 -&gt; Occupied(O), 3 -&gt; Occupied(X))
    ),
  nextTurn: O
}
</pre>
</div>
</div>
</div>
<div id="outline-container-usando-uma-invariante-para-procurar-jogos-que-d-o-velha-2" class="outline-3">
<h3 id="usando-uma-invariante-para-procurar-jogos-que-d-o-velha-2"><span class="section-number-3">1.13.</span> Usando uma invariante para procurar jogos que &ldquo;dão velha&rdquo;</h3>
<div class="outline-text-3" id="text-1-13">
<p>
&ldquo;Dar velha&rdquo;, ou <i>stalemate</i>, quer dizer que o tabuleiro está cheio e ninguém ganhou. É um empate.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">val stalemate = boardFull and not(won(X)) and not(won(O))

val NotStalemate = not(stalemate)
</pre>
</div>

<p>
Essa invariante é fácil de quebrar, podemos usar o simulador ao invés do <i>model checker</i> tranquilamente:<br />
</p>
<div class="org-src-container">
<pre class="src src-sh">quint run tictactoe.qnt --invariant=NotStalemate
</pre>
</div>

<p>
Mas podemos usar o <i>model checker</i> também! Ele vai demorar mais, porque faz BFS e vai levar um tempo para chegar em jogos com 9 jogadas feitas, que são necessárias para um tabuleiro completo.<br />
</p>
<div class="org-src-container">
<pre class="src src-sh">quint verify tictactoe.qnt --invariant=NotStalemate
</pre>
</div>
</div>
</div>
<div id="outline-container-contraexemplo-2" class="outline-3">
<h3 id="contraexemplo-2"><span class="section-number-3">1.14.</span> Contraexemplo</h3>
<div class="outline-text-3" id="text-1-14">
<div class="org-src-container">
<pre class="src src-quint">[State 9]
{
  board:
    Map(
      1 -&gt; Map(1 -&gt; Occupied(O), 2 -&gt; Occupied(X), 3 -&gt; Occupied(O)),
      2 -&gt; Map(1 -&gt; Occupied(O), 2 -&gt; Occupied(X), 3 -&gt; Occupied(X)),
      3 -&gt; Map(1 -&gt; Occupied(X), 2 -&gt; Occupied(O), 3 -&gt; Occupied(X))
    ),
  nextTurn: O
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-jogando-pra-ganhar-1" class="outline-2">
<h2 id="jogando-pra-ganhar-1"><span class="section-number-2">2.</span> Jogando pra ganhar</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-jogando-pra-ganhar-2" class="outline-3">
<h3 id="jogando-pra-ganhar-2"><span class="section-number-3">2.1.</span> Jogando pra ganhar</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Jogo da velha é um jogo bem simples e fácil<br /></li>
<li>Ainda quando crianças, enjoamos do jogo, porque percebemos que &ldquo;sempre dá velha&rdquo;<br /></li>
<li>Hipótese: Se um jogador seguir uma certa estratégia, ele nunca perde.<br />
<ul class="org-ul">
<li>Consequência: Se os dois jogadores seguirem essa estratégia, nenhum dos dois perde - &ldquo;sempre dá velha&rdquo;<br /></li>
</ul></li>
</ul>

<p>
<b>Estratégia</b>:<br />
</p>
<ul class="org-ul">
<li>A primeira jogada é sempre nos cantos<br /></li>
<li>As outras jogadas fazem a primeira jogada possível nessa lista de prioridade:<br />
<ul class="org-ul">
<li>Ganhar<br /></li>
<li>Bloquear<br /></li>
<li>Jogar no centro<br /></li>
<li>Preparar uma vitória (preenchendo 2 de 3 quadrados numa fila/coluna/diagonal)<br /></li>
<li>Jogada qualquer<br /></li>
</ul></li>
</ul>

<p>
Vamos implementar essa estratégia para o jogador X, enquanto o jogador O continua jogando &ldquo;de qualquer jeito&rdquo;.<br />
</p>
</div>
</div>
<div id="outline-container-come-ando-com-os-cantos-2" class="outline-3">
<h3 id="come-ando-com-os-cantos-2"><span class="section-number-3">2.2.</span> Começando com os cantos</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-quint">pure val corners = Set(
  (1,1),
  (3,1),
  (1,3),
  (3,3)
)

action StartInCorner =
  nondet corner = oneOf(corners)
  Move(X, corner)
</pre>
</div>
</div>
</div>
<div id="outline-container-condi-es-para-as-jogadas-2" class="outline-3">
<h3 id="condi-es-para-as-jogadas-2"><span class="section-number-3">2.3.</span> Condições para as jogadas</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Precisamos definir as condições que determinam se cada uma das jogadas na lista de prioridade pode ser feita.<br />
</p>
<ul class="org-ul">
<li>Ganhar<br /></li>
<li>Bloquear<br /></li>
<li>Jogar no centro<br /></li>
<li>Preparar uma vitória<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-quint">val canWin = winningPatterns.exists(canWinWithPattern)
val canBlock = winningPatterns.exists(canBlockWithPattern)
val canTakeCenter = isEmpty((2,2))
val canSetupWin = winningPatterns.exists(canSetupWinWithPattern)
</pre>
</div>

<p>
(<code>canWinWithPattern</code>, <code>canBlockWithPattern</code> e <code>canSetupWintWithPattern</code> a seguir)<br />
</p>
</div>
</div>
<div id="outline-container-condi-es-para-as-jogadas-defini-es-auxiliares-2" class="outline-3">
<h3 id="condi-es-para-as-jogadas-defini-es-auxiliares-2"><span class="section-number-3">2.4.</span> Condições para as jogadas - definições auxiliares</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Dado um <i>winning pattern</i>, podemos <b>ganhar</b> com aquele <i>pattern</i> sse duas das coordenadas tiverem <code>X</code> e a outra estiver vazia. Lembrando que a ordem não importa.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">def canWinWithPattern(pattern) = and {
  pattern.filter(coordinate =&gt; coordinate.hasPlayer(X)).size() == 2,
  pattern.filter(coordinate =&gt; coordinate.isEmpty()).size() == 1,
}
</pre>
</div>

<p>
Dado um <i>winning pattern</i>, podemos <b>bloquear</b> com aquele <i>pattern</i> sse duas das coordenadas tiverem <code>O</code> e a outra estiver vazia.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">def canBlockWithPattern(pattern) = and {
  pattern.filter(coordinate =&gt; coordinate.hasPlayer(O)).size() == 2,
  pattern.filter(coordinate =&gt; coordinate.isEmpty()).size() == 1,
}
</pre>
</div>

<p>
Dado um <i>winning pattern</i>, podemos <b>preparar uma vitória</b> com aquele <i>pattern</i> sse uma das coordenadas tiver <code>X</code> e as outras duas estiverem vazias.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">def canSetupWinWithPattern(pattern) = and {
  pattern.filter(coordinate =&gt; coordinate.hasPlayer(X)).size() == 1,
  pattern.filter(coordinate =&gt; coordinate.isEmpty()).size() == 2,
}
</pre>
</div>
</div>
</div>
<div id="outline-container-a-es-win-2" class="outline-3">
<h3 id="a-es-win-2"><span class="section-number-3">2.5.</span> Ações - Win</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-quint">action Win = all {
  canWin,
  nondet pattern = winningPatterns.filter(canWinWithPattern).oneOf()
  nondet coordinate = pattern.filter(isEmpty).oneOf()
  Move(X, coordinate),
}
</pre>
</div>
<ul class="org-ul">
<li><p>
Qual é a pré-condição pra essa ação?<br />
</p>
<ul class="org-ul">
<li><code>canWin</code>, lembrando que <code>canWin</code> é definido por:<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-quint">  val canWin = winningPatterns.exists(canWinWithPattern)
</pre>
</div>
<ul class="org-ul">
<li>Isso é importante para garantir que nunca estamos chamando <code>oneOf</code> em um set vazio.<br /></li>
</ul></li>
</ul>
</div>
</div>
