mfo/20240330105337-mfo_jogo_da_velha_em_quint.org
** Ações - Block
#+begin_src quint
action Block = all {
  canBlock,
  nondet pattern = winningPatterns.filter(canBlockWithPattern).oneOf()
  nondet coordinate = pattern.filter(isEmpty).oneOf()
  Move(X, coordinate),
}
#+end_src

#+BEAMER: \pause
Observem o uso de =oneOf= para selecionar a coordenada aqui. Nesses casos (tanto =Win= quanto =Block=), essa seleção é *determinística*, porque sabemos que sempre haverá uma única coordenada vazia nesses /patterns/. Contudo, o Quint não sabe disso.
#+BEAMER: \pause
- Não existe algo como "pegar o primeiro elemento do set" - porque sets não são ordenados!

** Ações - TakeCenter e SetupWin
#+begin_src quint
action TakeCenter = Move(X, (2, 2))

action SetupWin = all {
  nondet pattern = winningPatterns.filter(canSetupWinWithPattern).oneOf()
  nondet coordinate = pattern.filter(isEmpty).oneOf()
  Move(X, coordinate),
}
#+end_src


** Ações - alterando MoveX
Temos todas as ações para a estratégia definidas, agora basta definir um novo =MoveX= que chama essas ações conforme a prioridade estabelecida.
#+BEAMER: \pause
#+begin_src quint
action MoveX = all {
  nextTurn == X,
  if (boardEmpty) StartInCorner else
  if (canWin) Win else
  if (canBlock) Block else
  if (canTakeCenter) TakeCenter else
  if (canSetupWin) SetupWin else
  MoveToEmpty(X),
  nextTurn' = O,
}
#+end_src

** Invariantes
Com isso, temos nosso modelo. Agora, vamos definir algumas invariantes para o uso dessa estratégia.
#+begin_src quint
  /// X has not won. This does not hold, as X wins most of the times.
  val XHasNotWon = not(won(X))

  /// O has not won. This should hold, as O can only achieve a draw.
  val OHasNotWon = not(won(O))
#+end_src

** Fórmulas temporais
#+begin_src quint
/// This is not always true, as if O picks the right moves, the game will
/// result in a stalemate.
temporal XMustEventuallyWin = eventually(won(X))
#+end_src

- Infelizmente, a implementação de propriedades temporais no Apalache ainda é bem rudimentar.
- Podemos traduzir Quint pra TLA+ e usar o TLC para checar essa propriedade
  - Esse processo ainda tem alguns problemas, então vamos deixar quieto por enquanto
- O simulador não suporta fórmulas temporais
  - Poderia suportar com aquela implementação que fizemos em C++/Haskell na disciplina
- Vamos ver essa mesma especificação em TLA+, e aí podemos explorar melhor as propriedades temporais

** Tarefa de casa
 Tarefa para a próxima aula: ler o blogpost [[https://elliotswart.github.io/pragmaticformalmodeling/]]
   - Serve como uma revisão de alguns conteúdos da matéria até agora
   - Explica a modelagem do jogo da velha em TLA+, que veremos na próxima aula
   - Também conta como referência pra essa aula :)

** FIM
#+BEAMER: \maketitle
