docs/mfo/20240330105337-mfo_jogo_da_velha_em_quint.html
<div id="outline-container-a-es-block-2" class="outline-3">
<h3 id="a-es-block-2"><span class="section-number-3">2.6.</span> Ações - Block</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-quint">action Block = all {
  canBlock,
  nondet pattern = winningPatterns.filter(canBlockWithPattern).oneOf()
  nondet coordinate = pattern.filter(isEmpty).oneOf()
  Move(X, coordinate),
}
</pre>
</div>

<p>
Observem o uso de <code>oneOf</code> para selecionar a coordenada aqui. Nesses casos (tanto <code>Win</code> quanto <code>Block</code>), essa seleção é <b>determinística</b>, porque sabemos que sempre haverá uma única coordenada vazia nesses <i>patterns</i>. Contudo, o Quint não sabe disso.<br />
</p>
<ul class="org-ul">
<li>Não existe algo como &ldquo;pegar o primeiro elemento do set&rdquo; - porque sets não são ordenados!<br /></li>
</ul>
</div>
</div>
<div id="outline-container-a-es-takecenter-e-setupwin-2" class="outline-3">
<h3 id="a-es-takecenter-e-setupwin-2"><span class="section-number-3">2.7.</span> Ações - TakeCenter e SetupWin</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-quint">action TakeCenter = Move(X, (2, 2))

action SetupWin = all {
  nondet pattern = winningPatterns.filter(canSetupWinWithPattern).oneOf()
  nondet coordinate = pattern.filter(isEmpty).oneOf()
  Move(X, coordinate),
}
</pre>
</div>
</div>
</div>
<div id="outline-container-a-es-alterando-movex-2" class="outline-3">
<h3 id="a-es-alterando-movex-2"><span class="section-number-3">2.8.</span> Ações - alterando MoveX</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Temos todas as ações para a estratégia definidas, agora basta definir um novo <code>MoveX</code> que chama essas ações conforme a prioridade estabelecida.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">action MoveX = all {
  nextTurn == X,
  if (boardEmpty) StartInCorner else
  if (canWin) Win else
  if (canBlock) Block else
  if (canTakeCenter) TakeCenter else
  if (canSetupWin) SetupWin else
  MoveToEmpty(X),
  nextTurn' = O,
}
</pre>
</div>
</div>
</div>
<div id="outline-container-invariantes-2" class="outline-3">
<h3 id="invariantes-2"><span class="section-number-3">2.9.</span> Invariantes</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Com isso, temos nosso modelo. Agora, vamos definir algumas invariantes para o uso dessa estratégia.<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">  /// X has not won. This does not hold, as X wins most of the times.
  val XHasNotWon = not(won(X))

  /// O has not won. This should hold, as O can only achieve a draw.
  val OHasNotWon = not(won(O))
</pre>
</div>
</div>
</div>
<div id="outline-container-f-rmulas-temporais-2" class="outline-3">
<h3 id="f-rmulas-temporais-2"><span class="section-number-3">2.10.</span> Fórmulas temporais</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-quint">/// This is not always true, as if O picks the right moves, the game will
/// result in a stalemate.
temporal XMustEventuallyWin = eventually(won(X))
</pre>
</div>

<ul class="org-ul">
<li>Infelizmente, a implementação de propriedades temporais no Apalache ainda é bem rudimentar.<br /></li>
<li>Podemos traduzir Quint pra TLA+ e usar o TLC para checar essa propriedade<br />
<ul class="org-ul">
<li>Esse processo ainda tem alguns problemas, então vamos deixar quieto por enquanto<br /></li>
</ul></li>
<li>O simulador não suporta fórmulas temporais<br />
<ul class="org-ul">
<li>Poderia suportar com aquela implementação que fizemos em C++/Haskell na disciplina<br /></li>
</ul></li>
<li>Vamos ver essa mesma especificação em TLA+, e aí podemos explorar melhor as propriedades temporais<br /></li>
</ul>
</div>
</div>
<div id="outline-container-tarefa-de-casa-2" class="outline-3">
<h3 id="tarefa-de-casa-2"><span class="section-number-3">2.11.</span> Tarefa de casa</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Tarefa para a próxima aula: ler o blogpost <a href="https://elliotswart.github.io/pragmaticformalmodeling/">https://elliotswart.github.io/pragmaticformalmodeling/</a><br />
</p>
<ul class="org-ul">
<li>Serve como uma revisão de alguns conteúdos da matéria até agora<br /></li>
<li>Explica a modelagem do jogo da velha em TLA+, que veremos na próxima aula<br /></li>
<li>Também conta como referência pra essa aula :)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-fim-2" class="outline-3">
<h3 id="fim-2"><span class="section-number-3">2.12.</span> FIM</h3>
<div class="outline-text-3" id="text-2-12">
</div>
</div>
</div>

      </div>
    </div>
  </body>
</html>
